TG_TOTAL_git/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<vector> 
32768
(
(-0.0326792466143 -0.0326792466143 0.0653584932285)
(-0.0314234014901 -0.0967818947161 0.193563789434)
(-0.0289599726738 -0.15716526887 0.314330537752)
(-0.0253836283469 -0.211508869898 0.423017739804)
(-0.0208318054186 -0.257724303664 0.515448607336)
(-0.015479427891 -0.294035536984 0.588071073964)
(-0.00953218463006 -0.319047149508 0.63809429901)
(-0.00321862485961 -0.331797958978 0.663595917981)
...
)
;

boundaryField
{
    patch0_half0
    {
        type            cyclic;
    }
    patch0_half1
    {
        type            cyclic;
    }
    patch1_half0
    {
        type            cyclic;
    }
    patch1_half1
    {
        type            cyclic;
    }
    patch2_half0
    {
        type            cyclic;
    }
    patch2_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
